import { Explanations, ExplanationWithExamples } from '@/components/templates/lesson-structure/explanations';
import Choices from '@/components/templates/lesson-structure/choices';
import LessonEnd from '@/components/templates/lesson-structure/ending';

const lessonStructure = {
  Introduction: [
    <ExplanationWithExamples
      key="expn-exp1"
      explanations={["Prefix กลุ่มของตัวอักษรที่เพิ่มไว้หน้าคำเพื่อเปลี่ยนความหมายหรือสร้างคำใหม่"]}
      initExampleWord='ยกตัวอย่าง เช่น'
      examples={[
        ["un-", "ใน", "undo"],
        ["re-", "ใน", "rewrite"]
      ]}
      
    />,
    <ExplanationWithExamples
      key="expn-exp2"
      explanations={["กลุ่มของตัวอักษรที่เพิ่มต่อท้ายคำเพื่อแก้ไขความหมายหรือสร้างคำใหม่ซึ่งเปลี่ยน Part of speech ของคำด้วย"]}
      initExampleWord='ยกตัวอย่าง เช่น'
      examples={[
        ["-ing", "ใน", "running"],
        ["-ed", "ใน", "jumped"]
      ]}
      
    />,
    <Choices
      key="c-1"
      question='"Prefix" คืออะไร'
      choices={["กลุ่มของคำที่ต่อด้านหน้าคำศัพท์ แล้วทำให้ความหมายของคำเปลี่ยนไป", "คำอุปสรรค เช่น milli-, centi- ใช้เพื่อลดจำนวนเลขศูนย์ที่แสดงในจำนวนที่เป็นตัวเลข"]}
      answers={["กลุ่มของคำที่ต่อด้านหน้าคำศัพท์ แล้วทำให้ความหมายของคำเปลี่ยนไป"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-2"
      question='"Suffix" คืออะไร'
      choices={["กลุ่มคำที่มาต่อท้ายคำศัพท์", "กลุ่มคำที่สามารถเปลี่ยน part of speech ของคำนั้นได้", "ทั้งหมดที่กล่าวมา"]}
      answers={["ทั้งหมดที่กล่าวมา"]}
      mode="radio"
      xpGain={5}
    />,
    <LessonEnd
      key="end"
      descriptiveText='นี่เป็นเพียงจุดเริ่มต้นการเดินทางที่น่าจดจำ (จริงเหรอ?) ในหัวข้อนี้ ชู่... พอละ ฉันจะไม่สปอยเพิ่มอีก:)'
      stageName='Preliminary'
    />
  ],
  IntroductionToSuffix: [
    <Explanations
      key='exp1'
      explanations={["หลังจากที่เรารู้ว่า Prefix และ Suffix คร่าวๆแล้วว่าคืออะไร ก็ถึงเวลาที่เราจะเจาะลึกเข้าไปในแต่ละหัวข้อว่า มีอะไรในหัวข้อเหล่านั้นบ้าง", "ขอบอกก่อนนะว่า เราจะพูดถึงเพียงแค่ Suffix เท่านั้นในบทเรียน Preliminary นี้"]}
    />,
    <Explanations
      key='exp2'
      explanations={["Suffix มีทั้งหมด 7 ประเภท ได้แก่ Noun -> Noun Suffix, Verb -> Noun Suffix, Adjective -> Noun Suffix, Verb -> Adjective Suffix, Noun -> Adjective Suffix, Adjective -> Adverb Suffix และ Noun/Adjective -> Verb Suffix", 'ในหัวข้อถัดไป เราจะพูดถึง Noun -> Noun Suffix กัน']}
    />,
    <Choices
      key='c-1'
      question='เลือกทุกอย่างที่เป็นประเภทของ Suffix'
      choices={["Front suffixes", "Adjoint suffixes", "Noun -> Noun Suffix", "Verb -> Adjective Suffix", "Adjective -> Adverb Suffix"]}
      answers={["Noun -> Noun Suffix", "Verb -> Adjective Suffix", "Adjective -> Adverb Suffix"]}
      mode='check-box'
      xpGain={15}
    />,
    <LessonEnd
      key="end"
      descriptiveText={'คราวนี้คุณก็รู้จักประเภทของ Suffix แล้ว ต่อไปเราจะเริ่มเรียนเรื่อง Noun -> Noun Suffix กัน'}
      stageName='Preliminary'
    />
  ],
  NounNounSuffix: [
    <ExplanationWithExamples
      key='expn-exp1'
      explanations={["\"-ster\" อาจมีความหมายหลายแบบตามบริบทที่ใช้ แต่มักจะใช้ในการเรียกกลุ่มคน หรือสถานที่มีลักษณะแบบเดียวกัน และเพื่อสร้างคำที่มีลักษณะเฉพาะเจาะจงขึ้นมา"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Gangster", "คือ", "คนที่เข้าร่วมแก๊งค์อาชญากรรม."],
        ["Songster", "คือ", "นักร้องหรือผู้ที่ร้องเพลง"]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp2'
      explanations={["\"-er\" ใช้ในการสร้างคำนามหรือคนที่ทำหรือมีความเกี่ยวข้องกับสิ่งหรือกิจกรรมใด ๆ และมักจะเป็นคำที่ใช้ในการระบุหน้าที่หรืออาชีพของคน และมีหมายความว่า คนที่ทำ [สิ่งใดสิ่งหนึ่ง] หรือ คนที่มีความเกี่ยวข้องกับ [สิ่งใดสิ่งหนึ่ง] ตามความหมายของคำนั้น ๆ"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Teacher (ครู)", "-", "คำนามที่หมายถึงคนที่สอน."],
        ["Writer (นักเขียน)", "-", "คำนามที่หมายถึงคนที่เขียนบทความหรืองานเขียน."]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp3'
      explanations={["\"-et\", \"-let\" หรือ \"-ette\" มักถูกใช้ในการสร้างคำนามเพื่อระบุขนาดเล็กของสิ่งของหรือสร้างคำที่มีความเสมือนจริง เป็นลักษณะของสิ่งนั้น ๆ และมักใช้เพื่อสร้างคำที่มีความน่ารักหรือเป็นเล่น", "สำหรับ \"-ette\" หรือ \"-et\" นั้น ยังมีความหมายในเชิงที่ทำให้คำนามนั้นเป็นสิ่งเทียมได้อีกด้วย"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Kitchenette (ครัวขนาดเล็ก)", "-", "ห้องครัวเล็ก ๆ ที่มีอุปกรณ์พื้นฐานสำหรับทำอาหาร"],
        ["Piglet (ลูกหมู)", "-", "ลูกหมูตัวเล็กๆ น่ารัก"],
        ["Leatherette", "แปลว่า", "หนังเทียม"]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp4'
      explanations={["\"-ess\" หรือ \"-ine\" มักถูกใช้ในการสร้างคำนามที่ใช้เพื่อระบุเพศหรือเฉพาะสำหรับผู้หญิง โดยระบุว่าคนหรือสิ่งนั้นเป็นเพศหญิง หรือเป็นส่วนหญิงของสิ่งหนึ่ง ๆ ตามความหมายของคำนั้น ๆ"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Princess (เจ้าหญิง)", "หมายถึง", "สตรีที่มีตำแหน่งสูงในราชวงศ์."],
        ["Hostess (เจ้าภาพ)", "หมายถึง", "ผู้หญิงที่รับใช้และแสดงความเคารพต่อแขกในงานสังสรรค์หรือเทศกาล."],
        ["Heroine", "หมายถึง", "วีรสตรี"]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp5'
      explanations={["\"-hood\" มักถูกใช้ในการสร้างคำนามที่หมายถึงสถานะหรือสภาวะของการเป็นสมาชิกหรือส่วนหนึ่งของกลุ่มหรือสังคมใด ๆ"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Childhood (วัยเด็ก)", "หมายถึง", "ช่วงเวลาของการเป็นเด็ก"],
        ["Brotherhood (พี่น้องชาย)", "หมายถึง", "ความสัมพันธ์ระหว่างพี่น้องชายหรือความเป็นสมาชิกของกลุ่มชาย"]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp6'
      explanations={["\"-dom\" เป็นคำย่อมาจากคำว่า “domain” ในภาษาอังกฤษ มันถูกใช้เป็นลักษณะที่ใช้ในการเสริมความหมายของคำนามหรือคำคุณศัพท์ โดยมักจะใช้เพื่อระบุความเป็นของคำนามหรือกลุ่มคนหรือสิ่งของคำคุณศัพท์"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Kingdom (อาณาจักร)", "-", "เป็นกลุ่มของสิ่งมีชีวิตที่มีลักษณะคล้ายกัน เช่น อาณาจักรพืช และอาณาจักรสัตว์."],
        ["Fandom (แฟนๆ หรือความคบชู้)", "-", "กลุ่มคนที่รักและติดตามสิ่งที่พวกเขาชื่นชอบ, เช่น แฟนคลับของศิลปินหรือนักกีฬา"]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp7'
      explanations={["\"-ry\" หรือ \"-ery\" ในภาษาอังกฤษมักจะเป็นส่วนของคำนามที่ใช้เพื่อระบุสถานที่หรือสิ่งที่เกี่ยวข้องกับการทำหรือการเป็นของบางอย่าง และมักมีความเป็นส่วนหนึ่งของคำนามเอง", "นอกจากนั้น Suffix เหล่านี้มักจะมีความเชื่อมโยงกับการทำงานหรือสถานที่ที่เกี่ยวข้องกับการทำงานนั้น และช่วยให้เราเข้าใจความหมายของคำนามได้ดีขึ้นโดยไม่ต้องใช้คำอธิบายเพิ่มเติม."]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Bakery (ร้านขายขนมปัง)", "-", "สถานที่ที่ผลิตและขายขนมปังและขนมหวาน."],
        ["Cookery (การทำอาหาร)", "-", "กิจกรรมหรือกระบวนการทำอาหาร."]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp9'
      explanations={["\"-ian\" หรือ \"-an\" มักจะเป็นคำนามที่ใช้เพื่อระบุสิ่งต่าง ๆ ที่เกี่ยวข้องกับสถานที่, ประเทศ, หรือกลุ่มคนหรือสิ่งของใด ๆ ที่มีความเชื่อมโยงกัน", "และนอกจากนี้ยังมี Suffix \"-iana\" หรือ \"-ana\" ซึ่งจะแสดงนามกลุ่มก้อน เกี่ยวกับการรวบรวมข้อเท็จจริง"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["American", "มีความหมายเกี่ยวข้องกับ", "ประชาชนหรือสิ่งของที่เกี่ยวข้องกับสหรัฐอเมริกา"],
        ["Historian", "แปลว่า", "นักประวัติศาสตร์ (เกี่ยวข้องกับประวัติศาสตร์)"],
        ["Africana", "มีความหมายเกี่ยวข้องกับ", "เรื่องราวของแอฟริกา"],
        ["Victoriana", "มีความหมายเกี่ยวข้องกับ", "เรื่องราวของราชินีวิกตอเรีย"]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp10'
      explanations={["\"-y\" หรือ \"-ie\" มักถูกใช้ในการสร้างคำนามที่ใช้เพื่อเรียกชื่อสิ่งหรือคนที่มีลักษณะเฉพาะหรือเป็นทางเรื่องอารมณ์ -> ที่รัก หรือ เล็กๆ"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Sweetie", "ซึ่ง", "คำนี้สามารถใช้เรียกชื่อคนที่คุณรักหรือรักในทางเรื่องอารมณ์ได้."],
        ["Johny", "แปลว่า", "จอห์นที่รัก"],
        ["Kiddie", "แปลว่า", "เด็กเล็ก"]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp11'
      explanations={["\"-ism\" มักแสดงถึงความเชื่อหรือระบบคิดเช่นการมีความเชื่อหรือตั้งค่าทางวัฒนธรรมหรือสังคม หรือการรวบรวมคนหรือสิ่งของที่มีคุณสมบัติหรือตัวแทนเฉพาะเรื่องนั้น ๆ มาเป็นกลุ่มหรือการนิยาม."]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Capitalism", "คือ", "ระบบเศรษฐกิจที่เน้นการเป็นเจ้าของส่วนตัวและการดำเนินธุรกิจเพื่อกำไร"],
        ["Feminism", "คือ", "ความเชื่อในสิทธิและความเสมอภาคของเพศหญิง"],
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp12'
      explanations={["\"-ing\" จะบ่งบอกถึงวัสดุที่คำนามนั้นหมายถึง หรือสสารที่นามนั้นเอ่ยถึงประกอบรวมกัน"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Roofing", "คือ", "วัสดุมุงหลังคา เช่นกระเบื้อง"],
        ["Bedding", "คือ", "วัสดุบนเตียงนอน เช่นหมอน"],
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp12'
      explanations={["\"-ite\" คนที่เป็นสมาชิกของกลุ่มหรือเผ่า คนที่เชื่อหรือนิยมชมชอบในตัวผู้นำ หรือลัทธิความเชื่อ"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Israelite", "คือ", "กลุ่มชนชาวอิสราเอล"],
        ["Stalinite", "คือ", "คนที่ชื่นชอบสตาลิน"],
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp13'
      explanations={["\"-ship\"  หรือ \"-cy\" และ \"acy\" ต่างมีความหมายที่บ่งบอกถึง สถานะ คุณลักษณะ สภาพหรือสถาวะตำแหน่งเหมือนกัน แต่มีสิ่งที่แตกต่างกันเล็กน้อยคือ \"-acy\" และ \"-cy\" จะยังเป็นการบอกว่าคำนามนั้นเป็นสิ่งที่เกี่ยวกับบริษัท"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Friendship", "แปลว่า", "มิตรภาพ"],
        ["Professorship", "แปลว่า", "ตำแหน่งศาสตราจารย์"],
        ["Membership", "แปลว่า", "สมาชิกภาพ"],
        ["Workmanship", "แปลว่า", "ฝีมือการทำงาน"],
        ["Infancy", "แปลว่า", "วัยทารก"],
        ["Agency", "แปลว่า", "สำนักงานตัวแทน"]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp14'
      explanations={["\"-ist\" มีความหมายว่าคนที่ชำนาญการในการทำสิ่งใดสิ่งหนึ่ง ที่อาจได้รับการว่าจ้างให้ทำงานนั้น หรือคนที่ทำ ผลิิต เล่น หรือขายสิ่งหนึ่ง"]}
      initExampleWord="ยกตัวอย่างคำ เช่น"
      examples={[
        ["Scientist", "แปลว่า", "นักวิทยาศาสตร์"],
        ["Machinist", "แปลว่า", "คนดูแลเครื่องจักรกล"],
        ["Buddhist", "แปลว่า", "ชาวพุทธ"],
        ["Violinist", "แปลว่า", "นักเล่นไวโอลิน"],
      ]} 
    />,
    <Explanations
      key='exp-1'
      explanations={[
        "\"-ese\" บ่งบอกถึง ประชาชน หรือภาษาของประเทศต่างๆ ยกตัวอย่างคำ เช่น Japanese คือชาวญี่ปุ่นหรือภาษาญี่ปุ่น",
        "\"-ful\" จำนวนที่นามนั้นมีอยู่ บ่งบอกถึงจำนวนเต็มๆของตำนามนั้น เช่น Handful แปลว่า เต็มมือ",
        "\"-ing\" จะบ่งบอกถึงวัสดุที่คำนามนั้นหมายถึง หรือสสารที่นามนั้นเอ่ยถึงประกอบรวมกัน เช่น Bedding คือ วัสดุบนเตียงนอน เช่นหมอน",
        "\"-worth\" คำนามที่บอกถึงจำนวนที่มีค่าเท่ากับที่กำหนดของคำนามนั้น เช่น Pennyworth คือ มีค่าเท่ากับ 1 เพนนี",
        "\"-icle\" สื่อถึงว่าคำนามนั้นมีลักษณะเล็ก แต่ไม่ได้มีสื่อถึงทางด้านอารมณ์หรือความรู้สึกด้วยเหมือนกับ \"-et\" หรือ \"-ette\" เช่น icicle แปลว่า เกล็ดน้ำแข็งเล็กๆ",
        "\"-eer\" คนที่ทำงานในเรื่องหรือเกี่ยวข้องกับเรื่อง เช่น auctioneer คือ ผู้ขายทอดตลาด" 
      ]}
    />,
    <LessonEnd
      key="end"
      descriptiveText='เนื้อหาด่านนี้เยอะหน่อยนะ เดี๋ยวไปพักเบรกทำแบบฝึกหัดกัน'
      stageName='Preliminary'
      defaultXP={10}
    />
  ],
  NNSExercise: [
    <Choices
      key="c-1"
      question='Suffix ที่มีความหมายเกี่ยวกับ "กลุ่มคน" คืออะไร'
      choices={["-ster", "-er", "-or", "-ic"]}
      answers={["-ster"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-2"
      question='เลือกคำที่มีความหมายถูกต้องที่สุด'
      choices={["Kitchenette (ครัวเทียม)", "Piglet (ลูกหมู)", "Leatherette (หนังผืนเล็กๆ)"]}
      answers={["Piglet (ลูกหมู)"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-3"
      question='เลือกคำทั้งหมดซึ่งลงท้ายด้วย -er ที่มีความหมายเป็นอาชีพ ในภาษาอังกฤษ'
      choices={["Lehrer", "Schauspieler", "Doctor", "Commander", "Director", "Publisher"]}
      answers={["Commander", "Publisher"]}
      mode="check-box"
      xpGain={10}
    />,
    <Choices
      key="c-4"
      question='American ต่างจาก Americana อย่างไร'
      choices={["Americana ไม่เกี่ยวกับอเมริกา แต่ American เกี่ยว", "Americana เป็นเรื่องราวของอเมริกา แต่ American เป็นประชาชนชาวอเมริกัน", "American คือภาษาอเมริกา แต่ Americana คือประชาชนชาวอเมริกัน"]}
      answers={["Americana เป็นเรื่องราวของอเมริกา แต่ American เป็นประชาชนชาวอเมริกัน"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-5"
      question='ข้อใดไม่เข้าพวก'
      choices={["Sweetie", "Johny", "Daddy", "Kiddie", "Mummy", "Mommy"]}
      answers={["Mummy"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-6"
      question='ข้อใดต่อไปนี้ที่เมื่อเติม "-ing" ไปแล้วจะไม่ให้ความหมายว่าวัสดุ'
      choices={["Bed", "Roof", "Book"]}
      answers={["Book"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-7"
      question='เลือกคำดังต่อไปนี้ ที่สามารถนำ "-ship" ไปต่อแล้วได้ความหมายในเชิง สภาพหรือสถาวะตำแหน่ง'
      choices={["Friend", "Relation", "Drop", "Book", "Member", "Fire"]}
      answers={["Friend", "Relation", "Member"]}
      mode="check-box"
      xpGain={10}
    />,
    <Choices
      key="c-8"
      question='A handful of pennyworth coins แปลว่า'
      choices={["เหรียญที่มีค่า 1 เพนนีที่มีอยู่เต็มมือ", "เหรียญ \"เต็มมือ\" ที่มีค่า 1 เพนนี", "เต็มมือมีเหรียญอยู่ 1 เหรียญ", "เหรียญทั้งหมดเต็มมือมีค่ารวมกัน 1 เพนนี"]} 
      answers={["เหรียญที่มีค่า 1 เพนนีที่มีอยู่เต็มมือ"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-9"
      question='ข้อใดต่อไปนี้ผิด'
      choices={["Vietnamese คือประชาชนชาวเวียดนาม พูดภาษาเวียดนาม", "Chinese คือภาษาจีน หรือประชาชนชาวจีน", "Protugese คือชาวโปรตุกีส พูดภาษาโปรตุกีส"]} 
      answers={["Protugese คือชาวโปรตุกีส พูดภาษาโปรตุกีส"]}
      mode="radio"
      xpGain={5}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'คิดว่าคำถามกวนได้ใจไหม 555 คงกาพลาดไปหลายข้อเลยล่ะสิ'}
    />
  ],
  VerbNounSuffix: [
    <Explanations
      key='exp1'
      explanations={["โอเค ทุกคน!! ตอนนี้เราจะไปเรียนเรื่อง Verb -> Noun Suffix แล้วนะ พร้อมกันยังงง", "พร้อมไม่พร้อมไม่รู้ละ ไปเลยละกัน"]}
    />,
    <ExplanationWithExamples
      key='expn-exp2'
      explanations={['เราสามารถใช้ suffix "-er", "-ee", และ "-or" ในภาษาอังกฤษเพื่อสร้างคำใหม่จากคำต้นฉบับ และคำใหม่ที่สร้างขึ้นมักจะมีความหมายที่แตกต่างจากคำต้นฉบับ', 'โดย "-er" มักจะใช้สร้างคำนามที่หมายถึงบุคคลหรือสิ่งที่ทำบางอย่าง "-ee" ใช้สร้างคำนามที่หมายถึงบุคคลที่ได้รับการกระทำ หรือผู้ที่จะทำสิ่งต่างๆ และ "-or" ใช้สร้างคำนามที่หมายถึงบุคคลที่ทำบางอย่าง']}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["\"-er\"", "-->", "driver (ผู้ขับขี่), writer (ผู้เขียน)"],
        ["\"-ee\"", "-->", "employee (ผู้ถูกจ้าง), payee (ผู้รับเงิน), escapee (ผู้หลบหนี)"],
        ["\"-or\"", "-->", "director"],
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp3'
      explanations={['ในภาษาอังกฤษ, ทั้ง “-ant” และ “-ent” นั้นเป็น suffixes ที่ใช้ในการสร้างคำคุณภาพหรือคำนาม. ทั้งสอง suffixes นี้มาจากภาษาละตินและภาษาฝรั่งเศส, และมีความหมายว่า “ผู้ที่กำลังทำ” หรือ “สิ่งที่กำลังถูกทำ”. ', 'นอกจากนั้นยังหมายถึงสารเคมีที่ใช้เพื่อวัตถุประสงค์หนึ่ง']}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Assistant (ผู้ช่วย)", "มาจาก", "assist (ช่วย) + \"-ant\" (ผู้ที่กำลังทำ)"],
        ["Inhalant (ยาดม)", "มาจาก", "inhale (ดม) + \"-ant\" (สื่อถึงความเป็นสารเคมี)"],
        ["Different (ต่าง)", "มาจาก", "differ (ต่าง) + \"-ent\" (สิ่งที่กำลังถูกทำ)"],
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp4'
      explanations={["คำส่วนท้าย “-ation”, “-ition”, “-tion”, “-sion”, และ “-ion” ในภาษาอังกฤษเป็นส่วนที่เรียกว่า “suffix” หรือ “คำเสมือน” ที่ใช้ในการสร้างคำใหม่โดยการเพิ่มความหมายของคำที่มีอยู่แล้ว", "โดย “-ation” มักจะใช้กับคำกริยาเพื่อสร้างคำนามที่แสดงถึงการกระทำหรือผลลัพธ์ และ “-ition”, “-tion”, “-sion”, “-ion” เป็นคำเสมือนที่ใช้ในการสร้างคำนามจากคำกริยา"]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Information (ข้อมูล)", "มาจาก", "inform (แจ้งข้อมูล) + \"-ation\""],
        ["Definition (ความหมาย)", "มาจาก", "define (นิยาม) + \"-ition\""],
        ["Action (การกระทำ)", "มาจาก", "act (กระทำ) + \"-tion\""],
        ["Decision (การตัดสินใจ)", "มาจาก", "decide (ตัดสินใจ) + \"-sion\""],
        ["Opinion (ความคิดเห็น)", "มาจาก", "opine (แสดงความคิดเห็น) + \"-ion\""]
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp5'
      explanations={["คำเติมเข้าไปในภาษาอังกฤษที่มีลำดับ “-al” มีหลายความหมาย ขึ้นอยู่กับบริบทที่ใช้"]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["มีลักษณะของ", "เช่น", "remedial, denial"],
        ["สภาพ, คุณภาพ", "-", "-"],
      ]}
      
    />,
    <ExplanationWithExamples
      key='expn-exp6'
      explanations={["Suffix “-age” ในภาษาอังกฤษหมายถึงการกระทำ, สถานะ, หรือกระบวนการ"]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["postage", "มีความหมายคือ", "ค่าไปรษณีย์"],
        ["package", "มีความหมายคือ", "การห่อหุ้ม"],
        ["baggage", "มีความหมายคือ", "กระบวนการจัดกระเป๋า"],
        ["marriage", "มีความหมายคือ", "การสมรส"],
        ["breakage", "มีความหมายคือ", "การแตก"],
        ["passage", "มีความหมายคือ", "การผ่านไป (นอกจากนี้อาจหมายถึง บทความหรือทางได้เช่นกัน)"]
      ]} 
    />,
    <ExplanationWithExamples
      key='expn-exp7'
      explanations={["\"-ure\" หรือ \"-ment\" มักใช้เพื่อสร้างคำนามที่เกี่ยวข้องกับการกระทำหรือสถานที่ของการกระทำ แต่ \"-ment\" มักมีการนำมาใช้บ่อยกว่า โดยบางครั้งมีความหมายในทางบวกหรือทางลบ"]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Adventure", "แปลว่า", "การผจญภัย"],
        ["Improvement", "แปลว่า", "การปรับปรุง (ความหมายทางบวก)"],
        ["Punishment", "แปลว่า", "การลงโทษ (ความหมายทางลบ)"],
      ]} 
    />,
    <ExplanationWithExamples
      key='expn-exp8'
      explanations={["\"-ance\" หรือ \"-ence\" มักใช้เพื่อสร้างคำนามที่เกี่ยวข้องกับสภาพหรือคุณสมบัติ"]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Ambulance (รถพยาบาล)", "-", "สภาพหรือคุณสมบัติของการมีรถพยาบาล"],
        ["Confidence (ความเชื่อมั่น)", "-", "สภาพหรือคุณสมบัติของการมีความเชื่อมั่น"],
      ]} 
    />,
    <ExplanationWithExamples
      key='expn-exp9'
      explanations={["\"-and\" หรือ \"-end\" บ่งบอกว่ากริยานั้นถูกกระทำ"]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Addend", "แปลว่า", "จำนวนเลขที่ถูกบวก"],
        ["Multiplicant", "แปลว่า", "จำนวนเลขที่ถูกคูณ"],
      ]}
      notes={["นอกจากที่กล่าวมาแล้ว -and ยังมักนำมาใช้เป็นส่วนท้ายของคำกริยาที่ใช้เพื่อแสดงความเป็นธรรมดาหรือความเป็นกลาง โดยบางครั้งอาจมีความสัมพันธ์กับการเป็นสมาชิกหรืออัตราส่วนที่ปกติหรือเฉลี่ย เช่น Grand (ยิ่งใหญ่) - ใหญ่ในระดับปกติหรือเฉลี่ย และ -end มักใช้เพื่อแสดงการสิ้นสุดหรือลงท้ายของสิ่งใดสิ่งหนึ่ง โดยมักมีความหมายทางการจบลงหรือสิ้นสุด ใช้ในการอธิบายสถานการณ์หรือการเกิดเหตุการณ์ที่จบสิ้นสุดลงและมีความหมายทางบวกหรือลบได้ตามบริบทของประโยคที่ใช้"]} 
    />,
    <Explanations
      key='exp2'
      explanations={[
        "ในภาษาอังกฤษ, คำเสริม “-ing” ที่ต่อท้ายคำมักใช้แสดงถึงการกระทำที่กำลังเกิดขึ้นในปัจจุบัน หรือใช้แสดงถึงการกระทำ, สถานะ, หรือกระบวนการ. ตัวอย่างเช่น “landing”, “writing”, “ending”, “seating”, “blessing”, “feeding”",
      ]}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'เนื้อหาในด่านนี้เยอะหน่อยน้าา แต่อย่างน้อยก็น้อยกว่า Noun -> Noun Suffix ละกัน เอาเถอะ เดี๋ยวเราไปทำแบบฝึกหัดต่อ'}
      defaultXP={10}
    />
  ],
  VNSExercise:[
    <Choices
      key="c-1"
      question='Escapee กับ Employee ต่างกันอย่างไร'
      choices={["Escapee คือผู้ที่ถูกหลบหนี แต่ Employee คือผู้จ้าง", "Escapee คือผู้ที่หลบหนี แต่ Employee คือผู้ถูกจ้าง", "ไม่มีคำว่า Escapee ในพจนานุกรมภาษาอังกฤษ"]}
      answers={["Escapee คือผู้ที่หลบหนี แต่ Employee คือผู้ถูกจ้าง"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-2"
      question='Assistant ประกอบด้วยส่วนประกอบใดบ้าง และแต่ละส่วนประกอบมีความหมายว่าอะไร'
      choices={["assist (ช่วย) + \"-ant\" (ผู้ที่กำลังทำ)", "assist (ค่าหัว) + \"-ant\" (กำลังถูกล่า)", "asist (ช่วย) + \"-ant\" (มด)"]}
      answers={["assist (ช่วย) + \"-ant\" (ผู้ที่กำลังทำ)"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-3"
      question='Suffix ตัวใดไม่เข้าพวก'
      choices={["-ation", "-tion", "-sion", "-ition", "-ion", "-etion"]}
      answers={["-etion"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-4"
      question='เลือกคำทั้งหมดที่ไม่สามารถเติม Suffix "-age" ได้เลย (ต้องใส่ตัวอักษรเพิ่มก่อน เป็นต้น)'
      choices={["Break", "Marry", "Pack", "Bag", "Post", "Pass"]}
      answers={["Marry", "Bag", "Pass"]}
      mode="check-box"
      xpGain={10}
    />,
    <Choices
      key="c-5"
      question='คำใดมีความหมายทางบวก'
      choices={["Implement", "Punishment", "Improvement", "Movement"]}
      answers={["Improvement"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-6"
      question='นอกจาก "-and" หรือ "-end" บ่งบอกว่ากริยานั้นถูกกระทำแล้ว ยังสามารถบ่งบอกอะไรได้อีก'
      choices={["\"-and\" แสดงความเป็นธรรมดาหรือความเป็นกลาง", "คำตัวอย่างเพิ่มเติมของ -and คือ Brand", "\"-end\" ใช้อธิบายเหตุการณ์ที่ยังไม่สิ้นสุด"]}
      answers={["\"-and\" แสดงความเป็นธรรมดาหรือความเป็นกลาง"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-7"
      question='Suffix ใดถูกนำมาใช้บ่อยกว่า ระหว่าง "-ure" กับ "-ment"'
      choices={["-ure", "-ment"]}
      answers={["-ment"]}
      mode="radio"
      xpGain={5}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'รู้แนวการออกคำถามยัง อ่านดีๆ อย่ารีบ!'}
    />
  ],
  AdjectiveNounSuffix: [
    <Explanations
      key="exp-1"
      explanations={["ในหัวข้อนี้ เราจะแบ่ง Suffix ได้ออกเป็น 2 กลุ่มใหญ่ คือ", "กลุ่มที่บ่งบอกสภาวะ หรือลักษณะ ได้แก่ \"-ness\", \"-y\", และ \"-ty\" หรือ \"-ity\"", "กลุ่มที่บอกความเป็นบุคคลหรือสิ่งของที่มีความชำนาญหรือความเชี่ยวชาญ ได้แก่ \"-ist\""]}
    />,
    <Explanations
      key="exp-2"
      explanations={[
        "\"-ness\": รูปแบบนี้มักใช้ในการเปลี่ยนคำคุณศัพท์หรือคำกริยาเป็นคำนาม เพื่อแสดงถึงคุณลักษณะหรือสภาวะของสิ่งนั้น ๆ อย่างเฉพาะเจาะจง เช่น happiness (ความสุข), darkness (ความมืด), kindness (ความกรุณา) ซึ่งเน้นถึงคุณลักษณะหรือสภาวะของสิ่งนั้น ๆ", 
        "\"-y\": รูปแบบนี้มักใช้ในการเปลี่ยนคำคุณศัพท์หรือคำกริยาเป็นคำนาม เพื่อแสดงถึงคุณลักษณะหรือลักษณะของสิ่งนั้น ๆ โดยมักใช้ในกรณีที่คำนามที่เกิดขึ้นมีลักษณะที่เป็นประจำ  เช่น sunny (มีแสงแดด), hasty (รีบเร่ง), hairy (ขน), beauty (ความสวยงาม) และ ugly (น่าเหยียด) เน้นคุณลักษณะเฉพาะของสิ่งนั้น ๆ", 
        "\"ty\" หรือ \"-ity\": รูปแบบนี้มักใช้ในการเปลี่ยนคำคุณศัพท์หรือคำกริยาเป็นคำนามเพื่อแสดงถึงความสมบูรณ์หรือสภาวะของสิ่งนั้น ๆ อย่างสูงส่วน เช่น beauty (ความสวยงาม), loyalty (ความจงรักภักดี), integrity (ความซื่อสัตย์) เป็นต้น รูปแบบนี้มักใช้เพื่อบอกถึงคุณค่าหรือความสำคัญของสิ่งนั้น ๆ"]}
    />,
    <ExplanationWithExamples
      key="expn-exp1"
      explanations={["\"-ist\" บ่งชี้ถึงคนหรือสิ่งของที่มีความชำนาญในฐานะที่ระบุ โดยมักใช้ในคำศัพท์ที่เกี่ยวกับอาชีพ ศาสนา วิชาการ หรือศิลปะ"]}
      initExampleWord='โดยมีคำตัวอย่างดังนี้'
      examples={[
        ["Artist (ศิลปิน)", "คือ", "คนที่มีความชำนาญในการสร้างผลงานศิลปะ เช่น ภาพวาด หรือภาพถ่าย"],
        ["Feminist (นักสมัยศาสตร์)" ,"คือ", "คนที่สนับสนุนและต่อต้านความเสมอภาคเพศ"]
      ]}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'ด่านนี้สั้นดี ชอบไหม'}
      defaultXP={10}
    />
  ],
  NounAdjectiveSuffix: [
    // <Choices 
    //   key="c-1"
    //   question='วันนี้วันที่เท่าไร (Format: YYYY/M/DD)'
    //   choices={["2023/8/20", `${ new Date().getFullYear() }/${ new Date().getMonth() + 1 }/${ new Date().getDate() }`, "2022/9/20"]}
    //   answers={[`${ new Date().getFullYear() }/${ new Date().getMonth() + 1 }/${ new Date().getDate() }`]}
    //   mode='radio'
    //   xpGain={2}
    // />,
    <ExplanationWithExamples
      key='expn-exp1'
      explanations={["\"-ful\" หรือ \"-ate\" มักถูกเพิ่มลงในคำนามหรือคำกริยาเพื่อแสดงความเต็มเปี่ยมหรือความมีคุณสมบัตินั้นๆ หรือให้คำเป็นคำนามที่สื่อความหมายของ เต็ม หรือ เต็มไปด้วย"]}
      initExampleWord='ตัวอย่างคำ เช่น'
      examples={[
        ["Careful (ระมัดระวัง)", "เต็มไปด้วย", "การระมัดระวัง"],
        ["Beautiful (สวยงาม)", "เต็มไปด้วย", "ความงาม"],
        ["Passionate", "แปลว่า", "เต็มไปด้วยความหลงใหล"],
      ]}
    />,
    <ExplanationWithExamples
      key='expn-exp2'
      explanations={["\"-less\" ใช้ในคำนามหรือคำกริยาเพื่อแสดงความขาดหายไปหรือความไม่มีสิ่งหนึ่งหรือคุณสมบัติหนึ่งในคำนั้น ๆ คำที่ลงท้ายด้วย \"-less\" มักมีความหมายของ ไม่มี หรือ ขาด ในบริบทของคำนั้น ๆ"]}
      initExampleWord='ตัวอย่างคำ เช่น'
      examples={[
        ["Careless (ไม่ระมัดระวัง)", "ขาด", "ความระมัดระวังหรือไม่รู้สึกห่วง"],
        ["Homeless (ไม่มีบ้าน)", "ขาด", "ที่อยู่หรือไม่มีบ้าน"],
        ["Limitless (ไร้ขอบเขต)", "ไม่มี", "ขอบเขตหรือขีดจำกัด"]
      ]}
    />,
    <ExplanationWithExamples
      key='expn-exp3'
      explanations={["\"-y\" มักถูกเพิ่มลงในคำนามหรือคำกริยาเพื่อเปลี่ยนคำเหล่านั้นให้เป็นคำกริยาหรือคำนามที่เกี่ยวข้องกับสิ่งหรือคุณสมบัติที่คำนั้นอ้างถึง ส่วนท้าย \"-y\" มักมีความหมายทางคุณลักษณะหรือลักษณะเฉพาะเจาะจง โดยมักเพิ่มความหมายของ คล้าย หรือ เหมือน ในคำนั้น ๆ", "และนอกจากนั้นแล้ว ยังสื่อในความหมายของ เต็มไปด้วย ปกคลุมด้วย หรือมีแนวโน้มที่จะ"]}
      initExampleWord='ตัวอย่างคำ เช่น'
      examples={[
        ["Cloudy (มีเมฆ)", "-", "มีลักษณะของมีเมฆ หรืออาจปกคลุมไปด้วยเมฆ"],
        ["Silky", "แปลว่า", "เหมือนไหม"],
        ["Angry", "แปลว่า", "มีท่าทางโกรธ"],
        ["Dusty", "แปลว่า", "เต็มไปด้วยฝุ่นละออง"]
      ]}
    />,
    <ExplanationWithExamples
      key='expn-exp4'
      explanations={["\"-ish\" หรือ \"-like\" ใช้ในคำนามหรือคำกริยาเพื่อเปลี่ยนคำเหล่านั้นให้เป็นคำนามที่บ่งบอกถึงความคล้ายคลึงหรือลักษณะเป็นแบบอย่างของสิ่งหรือคนที่คำนั้นอ้างถึง มักมีความหมายของ คล้าย เป็นส่วนนึง หรือ เหมือน และมีการให้ลักษณะหรือลักษณะเฉพาะเจาะจงในคำนั้น ให้มีความชัดเจนมากขึ้นในบริบทของคำนั้น ๆ"]}
      initExampleWord='ตัวอย่างคำ เช่น'
      examples={[
        ["Businesslike (เหมือนธุรกิจ)", "-", "คล้ายกับการดำเนินธุรกิจหรือมีลักษณะของการดำเนินธุรกิจ"],
        ["Bookish (เป็นหนอนหนังสือ)", "-", "มีลักษณะของหนอนหนังสือหรือคนชอบอ่านหนังสือ"]
      ]}
    />,
    <ExplanationWithExamples
      key="expn-exp5"
      explanations={[
        "\"-able\", \"-ible\", \"-ous\" หรือ \"-ious\" มักใช้ในการสร้างคำศัพท์ที่แสดงถึงลักษณะของคำนามนั้น"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Fashionable", "แปลว่า", "มีลักษณะทันสมัย"],
        ["Sensible", "แปลว่า", "มีเหตุผล"],
        ["Courageous", "แปลว่า", "มีความกล้าหาญ"],
        ["Victorious", "แปลว่า", "มีชัยชนะ"]
      ]}
    />,
    <ExplanationWithExamples
      key="expn-exp6"
      explanations={[
        "\"-ic\", \"-ical\", \"-al\" หรือ \"-ial\" มักถูกเพิ่มลงในคำเพื่อบ่งบอกถึงคุณสมบัติหรือลักษณะของคำนั้น ๆ และสื่อถึงความเกี่ยวข้องกับคำ โดยทั่วไป และมักใช้ในคำที่เป็นคำนาม หรือในบางกรณีคำกริยา"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Economic (เศรษฐกิจ)", "เกี่ยวกับ", "เศรษฐกิจ"],
        ["Geometrical (เรขาคณิต)", "เกี่ยวกับ", "เรขาคณิต"],
        ["National (ชาติ)", "เกี่ยวกับ", "ชาติ"],
        ["Industrial (อุตสาหกรรม)", "เกี่ยวกับ", "อุตสาหกรรม"]
      ]}
    />,
    <ExplanationWithExamples
      key="expn-exp7"
      explanations={[
        "\"-worthy\" ใช้ในคำนามหรือคำกริยาเพื่อบ่งบอกถึงความคุ้มค่าหรือความสมควรของสิ่งหรือคนที่คำนั้นอ้างถึง \"-worthy\" มักมีความหมายของ คุ้มค่า หรือ สมควร ในคำนั้น ๆ"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Trustworthy (ที่น่าเชื่อถือ)", "-", "คุ้มค่าและน่าเชื่อถือ"],
        ["Noteworthy (น่าสังเกต)", "-", "ควรจะสังเกตหรือน่าสนใจ"],
      ]}
    />,
    <ExplanationWithExamples
      key="expn-exp8"
      explanations={[
        "\"-wise\" ใช้ในคำกริยาหรือคำนามเพื่อเปลี่ยนความหมายของคำนั้นเพิ่มเติมในบางประการ โดยทั่วไปส่วนท้าย \"-wise\" มักมีความหมายของ ในทิศทางของ หรือ เกี่ยวกับ ในคำนั้น ๆ"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Clockwise (ทิศเข็มนาฬิกา)" ,"-", "ในทิศทางของการหมุนเข็มนาฬิกา"],
        ["Healthwise (เกี่ยวกับสุขภาพ)", "-", "เกี่ยวกับสุขภาพหรือในบริบทของสุขภาพ"],
      ]}
    />,
    <ExplanationWithExamples
      key="expn-exp9"
      explanations={[
        "\"-some\" มักมีความหมายของ เต็มไปด้วย หรือ มีคุณสมบัติ ในคำนั้น ๆ แต่นอกจากนั้นแล้วก็นังมีความหมายในเชิง เป็น ชวน หรือก่อให้เกิดสิ่งใดสิ่งหนึ่ง ที่เกี่ยวข้องกับคำนาม"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Fearsome (น่ากลัว)" ,"-", "น่ากลัวหรือน่าเกรงขาม"],
        ["Burdensome", "แปลว่า", "เป็นภาระ"],
        ["Quarrelsome", "แปลว่า", "ชวนให้เกิดการทะเลาะวิวาท"],
        ["Troublesome", "แปลว่า", "ก่อให้เกิดความยุ่งยาก"]
      ]}
    />,
    <Explanations 
      key="exp-1"
      explanations={[
        "\"-esque\" มักมีความหมายของการให้ลักษณะหรือลักษณะเฉพาะเจาะจงในคำนั้น ๆ และมักใช้เพื่อเป็นการอธิบายความคล้ายคลึงกับสไตล์หรือลักษณะเฉพาะของสิ่งหรือคนที่คำนั้นอ้างถึง ส่วนท้าย \"-esque\" มักใช้ในบริบททางภาษาเพื่อเพิ่มความเจิดจรัสและลักษณะเด่นของสิ่งหรือคนที่คำนั้นพูดถึง",
        "เช่น Burlesque (ลักษณะของการบัลเลสก์) - เป็นลักษณะหรือลักษณะเฉพาะของการแสดงการบัลเลสก์",
        "\"-ly\" เป็นการบ่งบอกการเกิดขึ้นในช่วงเวลาที่กำหนด หรือลักษณะของคำนาม เมื่อเพิ่มให้กับคำนาม",
        "เช่น Cowardly คือ คนที่มีลักษณะขี้ขลาด และ Yearly คือช่วงระยะเวลาที่กำหนด 1 ปี"
      ]}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'ถ้าสังเกตดีๆ จะเห็นว่า Suffix บางตัวซ้ำกัน แต่พอไปรวมกับคำที่มี Part of speech ต่างกัน หน้าที่ก็ต่างกันนะ'}
      defaultXP={10}
    />
  ],
  NASExercise: [
    <Choices
      key="c-1"
      question='Suffix "-ful" ของ Noun -> Adjective คล้ายของ Noun -> Noun หรือไม่ เพราะเหตุใด '
      choices={["คล้าย เพราะเขียนเหมือนกัน", "ไม่คล้าย เพราะ Part of speech ที่เปลี่ยนไปเป็นคนละชนิดกัน", "คล้าย เพราะมีความหมายในเชิง เต็ม หรือ เต็มไปด้วยเหมือนกัน"]}
      answers={["คล้าย เพราะมีความหมายในเชิง เต็ม หรือ เต็มไปด้วยเหมือนกัน"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-2"
      question='ความหมายของคำที่ลงท้ายด้วย Suffix "-less"'
      choices={["ไม่มี", "ไม่หนี", "ไม่จ่าย"]}
      answers={["ไม่มี"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-3"
      question='เลือกคำที่มีความหมายถูกต้องทั้งหมด'
      choices={["Cloudy - นุ่มเหมือนเมฆ", "Silky - ทำท่าเหมือนไหม", "Angry - เต็มไปด้วยความโกรธ", "ไม่มีข้อใดถูก"]}
      answers={["ไม่มีข้อใดถูก"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-4"
      question='ให้คำอธิบายคำว่า Bookish ให้หน่อย'
      choices={["หนอนหนังสือ", "บรรณารักษ์", "คนที่ชอบอ่านหนังสือ", "คนหนังสือ"]}
      answers={["หนอนหนังสือ", "คนที่ชอบอ่านหนังสือ"]}
      mode="check-box"
      xpGain={10}
    />,
    <Choices
      key="c-5"
      question='Like ในฐานะ Suffix จะแปลว่า'
      choices={["คล้าย", "เหมือน", "ไลท์สายไฟด้วยตะกั่ว", "ชอบ", "เช่น"]}
      answers={["คล้าย", "เหมือน"]}
      mode="check-box"
      xpGain={10}
    />,
    <Choices
      key="c-6"
      question='Suffix ใดไม่เข้าพวก'
      choices={['"-able"', '"-ible', '"-icle"', '"-ous"', '"-ious"']}
      answers={['"-icle"']}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-7"
      question='Suffix "-ic", "-ical", "-al" หรือ "-ial" ใช้กับคำนามอย่างเดียวหรือไม่'
      choices={["ใช้กับคำนามอย่างเดียว ตามหัวข้อเรื่องเลย", "ไม่ อาจใช้กับคำคุณศัพท์ด้วย", "ไม่ อาจใช้กับคำกริยาด้วย"]}
      answers={["ไม่ อาจใช้กับคำกริยาด้วย"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-8"
      question='คำนามที่มี Suffix "-worthy" จะมีความหมายอย่างไรบ้าง'
      choices={["ความหมายในเชิงคุ้มค่า", "ความหมายในเชิงบ่งบอกคุณภาพ", "ความหมายในเชิงบ่งบอกคุณค่า", "ความหมายในเชิงบ่งบอกถึงความสมควร"]}
      answers={["ความหมายในเชิงคุ้มค่า", "ความหมายในเชิงบ่งบอกถึงความสมควร"]}
      mode="check-box"
      xpGain={10}
    />,
    <Choices
      key="c-9"
      question='Clockwise หมุนไปทางไหน'
      choices={["ทวนเข็มนาฬิกา", "หมุนจาก 0 ไป 𝝿/2 ไป 𝝿 ไป 3𝝿/2 แล้วจบที่ 2𝝿", "เข็มนาฬิกาหมุนจากเลข 10 เลข 11", "หมุนซ้าย"]}
      answers={["เข็มนาฬิกาหมุนจากเลข 10 เลข 11"]}
      mode="radio"
      xpGain={8}
    />,
    <Choices
      key="c-10"
      question='คำต่อไปนี้ลงท้ายด้วย Suffix "-esque" คำใดต่อไปนี้ไม่มีอยู่จริงในภาษาอังกฤษ'
      choices={["Kafkaesque", "Picturesque", "Burlesque", "Romanesque", "Sesque"]}
      answers={["Sesque"]}
      mode="radio"
      xpGain={8}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'2 ข้อสุดท้ายนี้เป็นยังไงบ้าง แทบมึนเลยใช่มะ โจทย์ที่ออกให้นี้ให้เอาสิ่งที่สอนให้ไปวิเคราะห์ต่ออีกทีนะ เพราะงั้นจำให้ได้ และวิเคราะห์ให้ดี'}
    />
  ],
  VerbAdjectiveSuffix: [
    <ExplanationWithExamples
      key="expn-exp1"
      explanations={[
        "-able และ -ible มักใช้ในการสร้างคำศัพท์ที่แสดงถึงความสามารถหรือความเป็นไปได้ของสิ่งหรือการกระทำบางอย่าง ซึ่งถือว่ามีความคล้ายคลึงกันมาก อย่างไรก็ตาม, มีข้อสังเกตบางอย่างระหว่างสอง Suffix นี้", "โดย\"-able\" จะใช้กับคำที่ไม่ได้มาจากภาษาละติน แต่ \"-ible\" จะใช้กับคำที่มาจากภาษาละติน", "รู้สึกคุ้นๆ บ้างไหม เราเจอ Suffix พวกนี้ในหัวข้อ Noun -> Adjective Suffix แล้วนะ"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Readable", "แปลว่า", "สามารถอ่านได้"],
        ["Teachable", "แปลว่า", "สามารถถูกสอนได้"],
        ["Visible", "แปลว่า", "สามารถมองเห็นได้"],
        ["Edible", "แปลว่า", "สามารถกินได้"],
      ]}
      
    />,
    <ExplanationWithExamples
      key="expn-exp2"
      explanations={[
        "-ary และ -ory มักใช้ในการสร้างคำศัพท์ที่เกี่ยวข้องกับสิ่งหรือการกระทำบางอย่าง แต่มีความแตกต่างบางอย่างในการใช้งานและความหมายของ Suffix เหล่านี้", "โดย -ary จะใช้กับสิ่งที่เกิดเป็นครั้งคราว และเกี่ยวกับอาชีพหรือความเชี่ยวชาญ แต่ -ory จะใช้กับสิ่งที่มีลักษณะเกิดขึ้นเป็นประจำ หรือเป็นส่วนๆหนึ่งของบางสิ่ง"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Revolutionary (นักปฏิวัติ)", "หมายความว่า", "เป็นคนที่มีส่วนร่วมในการปฏิวัติ ซึ่งเป็นเหตุการณ์ที่เกิดขึ้นเป็นครั้งคราว"],
        ["Dictionary (พจนานุกรม)", "หมายความว่า", "หนังสือที่รวบรวมคำศัพท์"],
        ["Factory (โรงงาน)", "หมายความว่า", "สถานที่ที่ผลิตสิ่งของเป็นประจำ"],
        ["History (ประวัติศาสตร์)", "หมายความว่า", "เรื่องราวหรือเหตุการณ์ที่เป็นอยู่เป็นประจำ"],
      ]}
      
    />,
    <ExplanationWithExamples
      key="expn-exp3"
      explanations={[
        "-ent ใช้ในคำกริยาที่อธิบายคุณลักษณะหรือสภาพภายในองค์ประกอบของสิ่งนั้น หรือลักษณะเฉพาะเจาะจงของบุคคลหรือสิ่งนั้น",
        "-ant จะมีความใกล้เคียงกับ -ent และนอกจากนั้นแล้ว จะใช้ในคำกริยาที่มักใช้ในบทเวลาหรือสถานการณ์ที่เป็นประจำ"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Constant", "แปลว่า", "คงที่หรือสิ่งที่เกิดขึ้นอยู่เสมอ"],
        ["Important", "แปลว่า", "สำคัญ"],
        ["Efficient", "แปลว่า", "ความมีประสิทธิภาพในตัวสิ่งนั้น"],
        ["Confident", "แปลว่า", "มีความมั่นใจในตนเอง"],
      ]}
      
    />,
    <ExplanationWithExamples
      key="expn-exp4"
      explanations={[
        "เมื่อคำลงท้ายด้วย -ive, มักจะหมายถึง สิ่งที่เกี่ยวข้องกับการทำ หรือ สิ่งที่มีลักษณะการกระทำ",
        "ในขณะที่คำลงท้ายด้วย -ative, มักหมายถึง สิ่งที่เกี่ยวกับ หรือ สิ่งที่มีลักษณะที่เกี่ยวข้องกับ"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Active (คล่องแคล่ว)", "มีความเกี่ยวข้องกับ", "การทำงานหรือการเคลื่อนไหว"],
        ["Informative (เพื่อการแจ้งข้อมูล)", "มีความเกี่ยวข้องกับ", "การให้ข้อมูลหรือข้อมูลที่เป็นประโยชน์"]
      ]}
      
    />,
    <ExplanationWithExamples
      key="expn-exp5"
      explanations={['-ed, -d มักใช้เพื่อแสดงกริยาที่ผ่านการกำหนดหรือเกิดขึ้นในอดีต หรือแสดงความสมบูรณ์ของกริยา ซึ่ง Suffix -d จะเติมต่อหลัง "e"', "นอกจากนั้น Suffix เหล่านี้ยังบ่งบอกถึงการที่คำเหล่านั้นแสดงการถูกกระทำของสิ่งๆหนึ่ง (Passive Voice) และแสดงถึงการที่คำนั้นเป็น Past Participle มีความหมายว่า \"รู้สึก...\""]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Walked", "แปลว่า", "เดิน (ในอดีต)"],
        ["Fried", "แปลว่า", "ผัด (ในอดีต) หรือ ถูกผัด"],
        ["Moved", "แปลว่า", "สะเทือนใจ"]
      ]}
      
    />,
    <ExplanationWithExamples
      key="expn-exp6"
      explanations={["\"-ic\" มักใช้เพื่อสร้างคำศัพท์ที่มีความหมายเกี่ยวข้องกับลักษณะ, ลักษณะเฉพาะ, หรือคุณลักษณะของสิ่งต่าง ๆ ในภาษาอังกฤษ. คำที่ลงท้ายด้วย \"-ic\" มักใช้เพื่อเสริมความเข้มแข็งหรือเพิ่มคุณลักษณะเฉพาะในคำนั้น ๆ"]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Romantic", "เกี่ยวกับ", "ความโรแมนติกหรือความหวัง"],
        ["Artistic", "เกี่ยวกับ", "เกี่ยวกับศิลปะหรือนักศิลป์"],
        ["Specific", "แปลว่า", "จำเพาะเจาะจง"],
        ["Horrific", "แปลว่า", "มีลักษณะที่น่ากลัว"]
      ]}
    />,
    <ExplanationWithExamples
      key="expn-exp7"
      explanations={["\"-ing\" ทำให้คำนั้นเป็น Adjective แบบ Present Participle มีความหมายขึ้นต้นคำว่า น่า..."]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Tiring", "แปลว่า", "น่าเบื่อ หรือน่าเหน็ดเหนื่อย"],
        ["Interesting", "แปลว่า", "น่าสนใจ"]
      ]}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'เก่งมากจ้ะ ยังเหลืออีก Suffix อีก 2 ประเภทนะ สู้สู้!'}
      defaultXP={10}
    />
  ],
  VASExercise: [
    <Choices
      key="c-1"
      question='เราเคยเจอกับ "-ible" และ "-able" ที่ไหน'
      choices={["ในห้องเรียนคาบภาษาอังกฤษ", "ในหัวข้อ Noun -> Adjective Suffix", "ไม่เคยเจอ จำไม่เห็นจะได้เลย"]}
      answers={["ในหัวข้อ Noun -> Adjective Suffix"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-2"
      question='ข้อใดคือความแตกต่างของ Suffix "-ary" กับ -ory"'
      choices={["เขียนต่างกัน", "\"-ary\" ใช้กับสิ่งที่เกิดขึ้นครั้งคราว แต่ \"-ory\" ใช้กับสิ่งที่เกิดขึ้นเป็นประจำ", "ไม่ต่างกัน"]}
      answers={["\"-ary\" ใช้กับสิ่งที่เกิดขึ้นครั้งคราว แต่ \"-ory\" ใช้กับสิ่งที่เกิดขึ้นเป็นประจำ"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-3"
      question='ข้อใดไม่เป็น Constant Value บ้าง'
      choices={["𝝿", "e", "Avogardo Constant", "ปริมาณความเข้มข้นของสารที่กำลังทำปฏิกิริยาเคมีกันอยู่", "g", "วันที่ เวลา"]}
      answers={["ปริมาณความเข้มข้นของสารที่กำลังทำปฏิกิริยาเคมีกันอยู่", "วันที่ เวลา"]}
      mode="check-box"
      xpGain={15}
    />,
    <Choices
      key="c-4"
      question='ความหมายของคำคุณศัพท์ Past Participle ขึ้นต้นด้วย'
      choices={["รู้สึก...", "หน้า...", "รู้...", "รู้จัก..."]}
      answers={["รู้สึก..."]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-5"
      question='แล้ว Present Participle ล่ะ'
      choices={["ไม่รู้สึก...", "หน้า...", "น่า...", "น้า..."]}
      answers={["น่า..."]}
      mode="radio"
      xpGain={5}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'เอาจริงๆนะ ฉันควรที่จะหยุดออกคำถามแปลกๆแบบข้อ 3 ได้ละนะ 555'}
    />
  ],
  AdjectiveAdverbSuffix: [
    <ExplanationWithExamples
      key="expn-exp1"
      explanations={[
        "\"-ly\" ใช้ในการเปลี่ยนคำกริยาหรือคำคุณศัพท์เป็นคำกริยาวิเศษหรือคำคุณศัพท์วิเศษโดยทั่วไป โดยมักใช้ในการแสดงถึงวิธีการกระทำ และมักใช้กับคำกริยา เปลี่ยนคำกริยาให้กลายเป็นคำกริยาที่มีคุณสมบัติของ \"อย่าง\" หรือ \"ด้วยวิธี\" แต่บางครั้งก็ใช้กับคำคุณศัพท์",
        "\"-ally\" มีความคล้ายคลึงกับ \"-ly\" โดยใช้ในการเปลี่ยนคำคุณศัพท์เป็นคำคุณศัพท์วิเศษโดยเฉพาะ และมักใช้กับคำคุณศัพท์ที่มีลักษณะเป็นบุรุษหรือเพศหญิง"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Quick", "เปลี่ยนเป็น", "Quickly (อย่างรวดเร็ว)"],
        ["Happy", "เปลี่ยนเป็น", "Happily (อย่างมีความสุข)"],
        ["Beautiful", "เปลี่ยนเป็น", "Beautifully (อย่างงดงาม)"],
        ["Dramatic", "เปลี่ยนเป็น", "Dramatically (อย่างรวดเร็วกระทันหัน)"]
      ]}
    />,
    <ExplanationWithExamples
      key="expn-exp2"
      explanations={[
        "\"-ably\" รูปแบบนี้มักใช้ในการเปลี่ยนคำคุณศัพท์เป็นคำคุณศัพท์วิเศษโดยทั่วไป",
        "\"-ibly\" รูปแบบนี้มักใช้ในบางคำคุณศัพท์ที่ลอกเลียนแบบคำคุณศัพท์ในรูปแบบ \"-able\" แต่มีความหมายหรือเสียงที่ไม่สามารถใช้ \"-ably\" ได้ โดยมักใช้ในบริบทที่พิเศษ"
      ]}
      initExampleWord="ยกตัวอย่าง เช่น"
      examples={[
        ["Comfortable", "เปลี่ยนเป็น", "Comfortably"],
        ["Reasonable", "เปลี่ยนเป็น", "Reasonably"],
        ["Horrible", "เปลี่ยนเป็น", "Horribly"],
        ["Terrible", "เปลี่ยนเป็น", "Terribly"],
      ]}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'หัวข้อหลังๆนี้จะไม่มีอะไรมากละ เพราะ Suffix ที่เปลี่ยนเป็น Adverb มีไม่ค่อยเยอะ'}
      defaultXP={10}
    />
  ],
  NounAdjectiveVerbSuffix: [
    <Explanations
      key="exp-1"
      explanations={["คำลงท้ายด้วย \"-en\", \"-efy\" / \"-ify\", \"-ize\" / \"-ise\", และ \"-ate\" มักเป็นลักษณะของคำกริยาที่มีการเปลี่ยนรูปหรือการเพิ่มส่วนท้ายเพื่อแสดงความหมายเฉพาะหรือเปลี่ยนคุณลักษณะของคำกริยาต้นฉบับ", "ซึ่งแม้ว่าจะมีความหมายว่า ทำให้ ทำให้กลายเป็น หรือก่อให้เกิดเหมือนกัน แต่ก็มีความแตกต่างกัน ดังที่จะแสดงให้ดูในนหน้าถัดๆไป"]}
    />,
    <Explanations
      key="exp-2"
      explanations={[
        "\"-en\" เป็นส่วนท้ายที่ใช้เพิ่มเข้ากับคำกริยาต้นฉบับเพื่อเปลี่ยนคุณลักษณะของคำนั้น ๆ โดยบางครั้งอาจมีการเปลี่ยนส่วนหน้าของคำกริยาด้วย",
        "เช่น Brighten แปลว่า ทำให้สว่าง, Darken แปลว่า ทำให้มืด",
        "\"-efy\" / \"-ify\" เป็นส่วนท้ายที่ใช้เพิ่มเข้ากับคำกริยาต้นฉบับเพื่อแสดงการทำให้เป็นหรือการแปลงให้เป็น",
        "เช่น Simplify แปลว่า ทำให้ง่าย, Intensify แปลว่า ทำให้แรงขึ้น",
        "\"-ize\" / \"-ise\" เป็นส่วนท้ายที่ใช้เพิ่มเข้ากับคำกริยาต้นฉบับเพื่อแสดงการกระทำหรือการเปลี่ยนแปลง",
        "เช่น Realize (รู้เรื่อง) - รู้เรื่องหรือเข้าใจ, Organize (จัดระเบียบ) - จัดระเบียบหรือสร้างระเบียบ",
        "\"-ate\" เป็นส่วนท้ายที่ใช้เพิ่มเข้ากับคำกริยาต้นฉบับเพื่อแสดงการกระทำหรือสถานะ",
        "เช่น Celebrate (เฉลิมฉลอง) - เฉลิมฉลองหรือทำให้เฉลิมฉลอง, Educate (ศึกษา) - ศึกษาหรือสอนให้รู้"
      ]}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'ใช่ มีแค่นี้แหละ ไม่ต้องตกใจไป เดี๋ยวมีให้ตอบคำถามวัดความรู้อยู่'}
      defaultXP={10}
    />
  ],
  TOPS3Exercise:[
    <Choices
      key="c-1"
      question='คำที่ลงท้ายด้วย "-ly" มักมีความหมายอย่างไรบ้าง'
      choices={["อย่าง...", "ระยะ...", "แนวโน้ม...", "ด้วยวิธี...", "...ดี"]}
      answers={["อย่าง...", "ด้วยวิธี..."]}
      mode="check-box"
      xpGain={10}
    />,
    <Choices
      key="c-2"
      question='ข้อใดที่เมื่อเติม -ly แล้วความหมายไม่ใกล้เคียงกับคำเดิม'
      choices={["Quick", "Dramatic", "Happy", "Beautiful"]}
      answers={["Dramatic"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-3"
      question='คำใดใช้ "-ibly" ไม่ได้'
      choices={["Horrific", "Terrible", "Horrible"]}
      answers={["Horrific"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-4"
      question='สิ่งใดบ่งบอกถึงข้อแตกต่างระหว่าง "-ise" และ "-ize"'
      choices={["การเขียน ซึ่ง \"-ise\" เป็นแบบ British และ \"-ize\" เป็นแบบ American", "ความหมาย ซึ่ง \"-ise\" มีความหมายว่าแสดงการกระทำ และ \"-ize\" ให้ความหมายว่าการเปลี่ยนแปลง", "ไม่มีข้อแตกต่างระหว่าง Suffix สองตัวนี้"]}
      answers={["การเขียน ซึ่ง \"-ise\" เป็นแบบ British และ \"-ize\" เป็นแบบ American"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-5"
      question='บอก Part of Speech ของ Darkness กับ Darken'
      choices={["Noun, Verb", "Adjective, Verb", "Verb, Noun", "Noun, Adverb"]}
      answers={["Noun, Verb"]}
      mode="radio"
      xpGain={5}
    />,
    <Choices
      key="c-6"
      question='Suffix ใดไม่ได้ให้ความหมายว่า "ทำให้..."'
      choices={["\"-en\"", "\"-ify\"", "\"-efy\"", "\"-ote\"", "\"-ate\""]}
      answers={["\"-ote\""]}
      mode="radio"
      xpGain={5}
    />,
    <LessonEnd
      key="end"
      stageName='Preliminary'
      descriptiveText={'และแล้วเราก็เดินทางมาสู่จุดจบของบทเรียนนี้...'}
    />
  ]
}

export default lessonStructure